app/views/trips/index.html.erb

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 2]]
---
          <td><%= participation.trip.end_date.strftime("%m/%d/%Y") %></td>
          <td><%= participation.trip.creator.first_name %></td>