app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"  WHERE "activities"."trip_id" = 1
---
  def index
    @activities = Activity.where(trip_id: params[:trip_id])

SELECT  "activities".* FROM "activities"  WHERE "activities"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @activity = Activity.find(params[:id])

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @trip = Trip.find(params[:trip_id])

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "activities" ("created_at", "creator_id", "description", "end_time", "location", "name", "start_time", "trip_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @activity = Activity.new(activity_params)
    @trip = Trip.find(params[:trip_id])
    @trip.activities << @activity

UPDATE "activities" SET "creator_id" = $1, "description" = $2, "end_time" = $3, "location" = $4, "name" = $5, "start_time" = $6, "trip_id" = $7, "updated_at" = $8 WHERE "activities"."id" = 83
---
  def update
    respond_to do |format|
      if @activity.update(activity_params)

DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 5]]
---
  def destroy
    @activity.destroy

SELECT  "activities".* FROM "activities"  WHERE "activities"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_activity
      @activity = Activity.find(params[:id])