app/controllers/trips_controller.rb

SELECT "trip_participations".* FROM "trip_participations"  WHERE "trip_participations"."traveler_id" = 10
SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 2]]
---
  def index
    @participations = TripParticipation.where(traveler_id: current_user.id)
    @trips = @participations.map{|participation| participation.trip}

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @activities = Trip.find(params[:id]).activities

INSERT INTO "trips" ("created_at", "creator_id", "description", "end_date", "location", "name", "start_date", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @trip = Trip.new(trip_params)
    current_user.created_trips << @trip

UPDATE "trips" SET "name" = $1, "updated_at" = $2 WHERE "trips"."id" = 125  [["name", "Ariel's Stupid Birthday"], ["updated_at", "2014-06-13 16:45:07.740274"]]
---
  def update
    respond_to do |format|
      if @trip.update(trip_params)

DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 2]]
---
  def destroy
    @trip.destroy

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_trip
      @trip = Trip.find(params[:id])