app/controllers/trip_participations_controller.rb

  def index
    @trip_participations = TripParticipation.all
---
SELECT "trip_participations".* FROM "trip_participations"